<template>
    <v-container fluid>
        <v-row>
            <v-col md="6" offset-md="3" sm="8" offset-sm="2" class="pt-0">
                <v-form>
                    <h3 class="text-center title">
                        Отправить отзыв
                    </h3>
                    <v-text-field
                        dense
                        label="Имя"
                        prepend-icon="mdi-account"
                    />
                    <v-textarea
                        dense
                        counter
                        label="Текст отзыва"
                        prepend-icon="mdi-text"
                        rows="3"
                    />
                    <div class="g-recaptcha" data-sitekey="6LfaXc8ZAAAAAHdMF2Dmjxd9OJU_QN5InSzKo1YE"></div>
                    <!-- <br/> -->
                    <v-btn color="success" class="mt-2" @click="submit">Отправить</v-btn>
                </v-form>
            </v-col>
        </v-row>
        <h3 class="text-center title">
            Отзывы
        </h3>
        <v-card v-for="(review, index) in reviews" :key="index" class="mb-2">
            <v-card-title>
                <p class="title pa-0 ma-0 align-self-center">{{ review.author }}</p>
                <v-container class="d-flex pa-0" fluid>
                    <v-icon left small>mdi-clock</v-icon>
                    <p class="text-body-1 pa-0 ma-0 align-self-center">{{ new Date(review.published).toLocaleString() }}</p>
                </v-container>
            </v-card-title>
            <v-card-text>
                <p class="text-body-1 ma-0 text-justify" style="text-indent: 2em">{{ review.text }}</p>
            </v-card-text>
        </v-card>
    </v-container>
</template>

<script>
export default {
    data: () => ({
        reviews: [
          {
            "author": "Альбина Казакова",
            "published": "Monday, 24 June 2019 17:46",
            "text": "Хочу выразить самые искренние слова благодарности самой лучшей автошколе. Никогда не думала, что ДАСААФ может стать такой близкой, почти семьёй.\nОгромная благодарность Владимиру Александровичу Панькину за бесценные знания, терпение и тактичность, за искренние переживания, за веру в успех, за всё!\nОт всего сердца желаю коллективу крепкого здоровья, благополучия и удачи!!! Ещё раз низкий поклон!"
          },
          {
            "author": "Иванов Дмитрий",
            "published": "Wednesday, 24 April 2019 19:53",
            "text": "Недавно я наконец-то получил права благодаря Каменской автошколе ДОСААФ России. Преподаватели в школе - настоящие профессионалы, это чувствуется. Мой преподаватель теории - Шиманский Александр Богданович, объяснял все очень подробно и доступно, поэтому на экзамене проблем не возникло, все без ошибок. Вождению я обучался у Мезенцева Михаила Юрьевича - опытного инструктора, который очень терпеливо относился к моим ошибкам за рулем и смог научить водить автомобиль даже меня, за что ему отдельное спасибо. К слову, автомобили в автошколе все достаточно новые, ухоженные, в хорошем состоянии, я, например ездил на ВАЗ - 2107. Экзамен я сдал с первого раза и теперь могу спокойно ездить за рулем. Большое спасибо!"
          },
          {
            "author": "Дзюкенова Асия",
            "published": "Tuesday, 05 June 2018",
            "text": "Сегодня закончила автошколу. Хочется выразить огромную благодарность преподавателю Шиманскому Александру Борисовичу за прекрасную подачу ПДД. Все понятно и четко. Еше поблагодарить инструктаров Панькина Владимира Александровича, Серова Николая Николаевича особенно,\nКорытцева Александра Васильевича. За их знания,терпение. Большое спасибо!!!!"
          },
          {
            "author": "Борискина тамара",
            "published": "Saturday, 18 November 2017 17:52",
            "text": "Экзамены позади, права в кармане, благодаря уникальному преподавателю теории Шиманскому Александру Богдановичу. Только самый ленивый не поймёт его объяснения. Огромное спасибо за величайшее терпение мастерам ПОВ учебной гр. № 19в (В) Панькину Владимиру Александровичу (отдельный низкий поклон и уважение), Корытцеву Александру Васильевичу, Мезенцеву Михаилу Юрьевичу. Афонькину Юрию Леонидовичу. Дальнейшего процветания и развития автошколе. Если учиться, то только тут. Мастера ПОВ с огромным опытом работы и желанием учить."
          },
          {
            "author": "Выпускники группы 9В",
            "published": "Friday, 22 July 2016 21:12",
            "text": "Выражаем огромную благодарность коллективу Каменской автошкола ДОСААФ РОССИИ.\nОгромное спасибо Шиманскому Александру Богдановичу за великолепную подачу теоретического материала. Все четко, ясно и понятно. Занятия проходили в теплой дружественной атмосфере. Здесь можно было, не боятся допустить ошибку, Александру Богданович всё объяснит, если надо. Ходить на его занятия было интересно и приятно. Очень понравилось, что помимо сухой теории присутствует разбор жизненных ситуаций. На все вопросы найдется ответ. Спасибо!\nОсобая благодарность за проявленное спокойствие и терпение инструктору по вождению Панькину Владимиру Александровичу, который научил всему, что необходимо знать для уверенности на дороге, подробно объясняя все и на автодроме, и в городе.\nТак же благодарность всем остальным инструкторам, которые поддерживали нас во время экзаменов.\nЕще раз большое спасибо за ваш труд!"
          },
          {
            "author": "Галина",
            "published": "Monday, 04 July 2016 20:38",
            "text": "Каменская автошкола ДОСААФ РОССИИ оснащена хорошей материальной технической базой (КАМАЗЫ, мустанги 4350). Имеет отличные классы для подготовки водителей всех категорий А, В,С,Д, Е. Отличные преподаватели Шеманский А.Б. , Маркелов В.В., а также мастера производственного обучения вождению Панькин В..А., Серов Н.Н, Корытцев А.В., Мезенцев М.Ю. , Жучкин А.А., Мерекин Р.С. и т.д.Каменская автошкола самая лучшая и его руководящий состав Афонькин Ю.Л."
          },
          {
            "author": "Шахновская Ольга",
            "published": "Sunday, 30 August 2015 18:02",
            "text": "Очень уважаю и люблю людей, которые работают на своем месте и ценят свою работу. Огромное спасибо Серову Николаю Николаевичу и Маркелову Владимиру Викторовичу! Инструктор и преподаватель от Бога!!!\nСпасибо Вам за ваше терпение и внимание, за то, что Вы верили в нас, за Вашу поддержку. Желаю Вам удачи и везения по жизни, ну и, конечно, способных и воспитанных курсантов.\nПусть ваша школа процветает и выпускает с каждым годом все больше и больше курсантов!!!\n28 августа сдала экзамен и получила права! Всем огромное спасибо!!!!!!!!"
          },
          {
            "author": "Буркина Галина",
            "published": "Saturday, 29 August 2015 11:49",
            "text": "Вчера сдала экзамен и получила права! Ура!!!\nХочу сказать БОЛЬШОЕ СПАСИБО нашему преподавателю - Маркелову Владимиру Викторовичу за отличные полученные знания и начальную практику вождения (последние 3 недели перед экзаменом ездила только с ним). Всем инструкторам, которые терпеливо и доходчиво объясняли и делились своими личными секретами грамотного вождения автомобиля на дорогах нашего города и не только. Михаил Юрьевич, Олег Анатольевич, Виктор Иванович, Николай Николаевич, Александр Васильевич - СПАСИБО!!!\nОтдельная благодарность начальнику автошколы Юрию Леонидовичу, за тактичность и профессионализм. Спасибо!!!"
          },
          {
            "author": "Пивоварова Ольга",
            "published": "Wednesday, 24 June 2015 07:33",
            "text": "Школу окончила 2 года назад. Хочу выразить благодарность Александру Богдановичу, Виктору Ивановичу и Александру Васильевичу, большое вам спасибо!"
          },
          {
            "author": "Flores",
            "published": "Tuesday, 25 November 2014 14:53",
            "text": "Автошколу окончила в прошлом году! Практика была с инструктором Бусовым Е.А., отличный инструктор!!!! С первого дня получения прав выехала на своем автомобиле и за год с небольшим ни одного ДТП (езда по Пензе)!!Спасибо большое инструктору!!!Побольше таких!!!"
          },
          {
            "author": "пол вокер",
            "published": "Saturday, 27 September 2014 20:01",
            "text": "Учился в досааф, все понравилось, инструктора нормальные мужики!\nСам ездил с Бусовым на логане.\nСамая лучшая автошкола!"
          },
          {
            "author": "Вин Дизель",
            "published": "Wednesday, 24 September 2014 18:34",
            "text": "Учился в ДОСААФ от военкомата,нисколько не пожалел)))!!!Спасибо огромное инструкторам ВАЗ-2107 Маркелову В.В., Кулагину Г.А. и инструкторам грузовых автомобилей Камаз-4310 и Урала Жучкину А.Н., Мерёкину Р.С. ЛУЧШЕ АВТОШКОЛЫ НЕТ!!!))))"
          },
          {
            "author": "avtoscool",
            "published": "Wednesday, 24 September 2014 16:05",
            "text": "Когда автошкола начнет готовить по новым программам?"
          }
        ]
    }),
    methods: {
        submit() {
            // const captchaResponse = grecaptcha.getResponse()
            console.log(window.grecaptcha.getResponse())

            if (window.grecaptcha.getResponse()) {

                // send review here

                // parsing function of reviews in original site
                // [...document.querySelectorAll('.commentstd')].slice(1).map((el) => ({
                //     name: (el.querySelector('.com-meta strong') || el.querySelector('.com-meta a')).innerText,
                //     published: el.querySelector('.com-meta em').innerText,
                //     text: el.querySelector('.commententry').innerText
                // }))

                window.grecaptcha.reset()
            }
        }
    },
    mounted() {
        const recaptchaScript = document.createElement('script')
        recaptchaScript.setAttribute('src', 'https://www.google.com/recaptcha/api.js')
        recaptchaScript.async = recaptchaScript.defer = true
        document.head.appendChild(recaptchaScript)
    }
}
</script>